# GroupNode Class (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
GroupNode Class
Members See Also
---
A node that represents set of individual elements grouped together in some form, such as an instance of a family or linked Revit file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class GroupNode : RenderNode
```

Visual Basic
---
```text
Public Class GroupNode _
	Inherits RenderNode
```

Visual C++
---
```text
public ref class GroupNode : public RenderNode
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..RenderNode Autodesk.Revit.DB..::..GroupNode Autodesk.Revit.DB..::..InstanceNode Autodesk.Revit.DB..::..LinkNode
# See Also
GroupNode Members
Autodesk.Revit.DB Namespace